# 1. Reading Data

In [2]:
import pandas as pd

In [52]:
df=pd.read_csv("C:\\Users\\user\\Desktop\\sample.csv")

# 2. Inspecting the Data
* 1.head()
* 2.tail()
*  3.shape
* 4.info()
*  5.describe()
*  6.index
*  7.dtypes
*  8.columns

In [53]:
df.head()

      Name   Age Gender  Score    JoinDate
0    Alice  25.0      F   85.0  2020-01-15
1      Bob  30.0      M   90.0  2019-06-23
2  Charlie  35.0      M   95.0  2021-07-19
3    David   NaN      M   88.0  2022-09-10
4      Eva  45.0      F    NaN  2018-04-12

In [7]:
df.tail()

      Name   Age Gender  Score    JoinDate
0    Alice  25.0      F   85.0  2020-01-15
1      Bob  30.0      M   90.0  2019-06-23
2  Charlie  35.0      M   95.0  2021-07-19
3    David   NaN      M   88.0  2022-09-10
4      Eva  45.0      F    NaN  2018-04-12

In [67]:
df.shape

(5, 5)

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      5 non-null      object
 1   Age       4 non-null      float64
 2   Gender    5 non-null      object
 3   Score     4 non-null      float64
 4   JoinDate  5 non-null      object
dtypes: float64(2), object(3)
memory usage: 332.0+ bytes

In [69]:
df.describe()

             Age      Score
count   4.000000   4.000000
mean   33.750000  89.500000
std     8.539126   4.203173
min    25.000000  85.000000
25%    28.750000  87.250000
50%    32.500000  89.000000
75%    37.500000  91.250000
max    45.000000  95.000000

In [70]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [71]:
df.dtypes

Name         object
Age         float64
Gender       object
Score       float64
JoinDate     object
dtype: object

In [72]:
df.columns

Index(['Name', 'Age', 'Gender', 'Score', 'JoinDate'], dtype='object')

# 3. Accessing & Filtering

In [73]:
df["Name"]     # Accessing single column ; output as a series

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
Name: Name, dtype: object

In [74]:
df[["Name"]]   # now output as a df because of double brace

      Name
0    Alice
1      Bob
2  Charlie
3    David
4      Eva

In [75]:
df[["Name","Gender"]]   # Accessing multiple columns

      Name Gender
0    Alice      F
1      Bob      M
2  Charlie      M
3    David      M
4      Eva      F

## For accessing the data we have 2 methods in pandas i.e.
### loc[ ]
 * 1.loc[]: label based selection
 * selects the data by labels of rows and cols 
 * loc[row_selection,col_selection]
 * here start and stop both are inclusive
 
 
 
 ### iloc[ ]
 * 2.iloc[]: integer position based selection
 * selects the data by integer positions
 * iloc[row_position,column_position]
 * here end is exclusive (like python slicing)

In [76]:
df.loc[0]   #0th row as a series

Name             Alice
Age               25.0
Gender               F
Score             85.0
JoinDate    2020-01-15
Name: 0, dtype: object

In [77]:
df.loc[0:5]  # all the rows

      Name   Age Gender  Score    JoinDate
0    Alice  25.0      F   85.0  2020-01-15
1      Bob  30.0      M   90.0  2019-06-23
2  Charlie  35.0      M   95.0  2021-07-19
3    David   NaN      M   88.0  2022-09-10
4      Eva  45.0      F    NaN  2018-04-12

In [78]:
df.loc[0:5,["Name","Age"]]     # for all the rows displaying name and age only

      Name   Age
0    Alice  25.0
1      Bob  30.0
2  Charlie  35.0
3    David   NaN
4      Eva  45.0

In [79]:
df.loc[df["Age"]>20]        # Filtering  


#df["age"]>20 gives boolean series and by adding df.loc[] that will return rows which are true

      Name   Age Gender  Score    JoinDate
0    Alice  25.0      F   85.0  2020-01-15
1      Bob  30.0      M   90.0  2019-06-23
2  Charlie  35.0      M   95.0  2021-07-19
4      Eva  45.0      F    NaN  2018-04-12

In [80]:
df.iloc[0] # single row as series

Name             Alice
Age               25.0
Gender               F
Score             85.0
JoinDate    2020-01-15
Name: 0, dtype: object

In [81]:
df.iloc[0:5]  # all rows

      Name   Age Gender  Score    JoinDate
0    Alice  25.0      F   85.0  2020-01-15
1      Bob  30.0      M   90.0  2019-06-23
2  Charlie  35.0      M   95.0  2021-07-19
3    David   NaN      M   88.0  2022-09-10
4      Eva  45.0      F    NaN  2018-04-12

In [82]:
df.iloc[0:5,0:1]  # gives the first column of all rows

      Name
0    Alice
1      Bob
2  Charlie
3    David
4      Eva

In [83]:
df.iloc[0:4,3]  # 4th column score of first 4 rows

0    85.0
1    90.0
2    95.0
3    88.0
Name: Score, dtype: float64

In [84]:
df.iloc[[0,1,2],[2,3,4]]  # first 3 rows and last 3 cols

  Gender  Score    JoinDate
0      F   85.0  2020-01-15
1      M   90.0  2019-06-23
2      M   95.0  2021-07-19

In [85]:
df.iloc[[True, False, True,True,True]]  # true means presense of  that row, false means absense of that row

      Name   Age Gender  Score    JoinDate
0    Alice  25.0      F   85.0  2020-01-15
2  Charlie  35.0      M   95.0  2021-07-19
3    David   NaN      M   88.0  2022-09-10
4      Eva  45.0      F    NaN  2018-04-12

# 3. Filtering

In [86]:
df[df["Age"]>20]

      Name   Age Gender  Score    JoinDate
0    Alice  25.0      F   85.0  2020-01-15
1      Bob  30.0      M   90.0  2019-06-23
2  Charlie  35.0      M   95.0  2021-07-19
4      Eva  45.0      F    NaN  2018-04-12

In [87]:
df[df["Gender"]=='F']

    Name   Age Gender  Score    JoinDate
0  Alice  25.0      F   85.0  2020-01-15
4    Eva  45.0      F    NaN  2018-04-12

In [88]:
df[df["Gender"]=='M']

      Name   Age Gender  Score    JoinDate
1      Bob  30.0      M   90.0  2019-06-23
2  Charlie  35.0      M   95.0  2021-07-19
3    David   NaN      M   88.0  2022-09-10

In [89]:
df[(df["Age"]>20) & (df["Gender"]=='F')]    # multiple conditions

    Name   Age Gender  Score    JoinDate
0  Alice  25.0      F   85.0  2020-01-15
4    Eva  45.0      F    NaN  2018-04-12

In [90]:
df[(df["Age"]>20) | (df["Age"]>25)]

      Name   Age Gender  Score    JoinDate
0    Alice  25.0      F   85.0  2020-01-15
1      Bob  30.0      M   90.0  2019-06-23
2  Charlie  35.0      M   95.0  2021-07-19
4      Eva  45.0      F    NaN  2018-04-12

In [91]:
df.query("Age>25 and Gender == 'F'")    # it is also used for filtering with multiple conditions

  Name   Age Gender  Score    JoinDate
4  Eva  45.0      F    NaN  2018-04-12

In [92]:
df.query("Score >25")

      Name   Age Gender  Score    JoinDate
0    Alice  25.0      F   85.0  2020-01-15
1      Bob  30.0      M   90.0  2019-06-23
2  Charlie  35.0      M   95.0  2021-07-19
3    David   NaN      M   88.0  2022-09-10

# 4. Cleaning & Transforming the data

### 1. isnull() -- 
 * Checks missing values
### 2. dropna() 
 * drop the rows with missing values
 * dropna(axis=1)--removes columns with missing values
### 3. fillna()
 * fill the missing values with specific method
 * interpolate() used for complex and large data

In [93]:
df.isnull().sum()    #checking null values

Name        0
Age         1
Gender      0
Score       1
JoinDate    0
dtype: int64

In [94]:
# dropna() --removes the rows with missing values

In [95]:
df["Age"]=df["Age"].fillna(df["Age"].mean())    # filling with mean

In [96]:
df["Age"]=df["Age"].fillna(20)    #filling with specific value

In [97]:
df["Age"]=df["Age"].fillna(0)    # filling with 0

In [98]:
df["Age"]=df["Age"].fillna(method="ffill")   # forward filling

In [99]:
df["Age"]=df["Age"].fillna(method="bfill")   # backward filling

In [100]:
df["Score"]=df["Score"].fillna(df["Score"].mean())

## rename()
* to rename the column names

In [106]:
df.rename(columns={'Name':"FullName","Score":"TestScore"})

  FullName    Age Gender  TestScore    JoinDate
0    Alice  25.00      F       85.0  2020-01-15
1      Bob  30.00      M       90.0  2019-06-23
2  Charlie  35.00      M       95.0  2021-07-19
3    David  33.75      M       88.0  2022-09-10
4      Eva  45.00      F       89.5  2018-04-12

## astype()
* to change the datatype of a column

In [107]:
df["Age"]=df["Age"].astype('float32')

In [108]:
df["Score"]=df["Score"].astype("float32")

## drop()
* drop the columns that are no longer needed

In [118]:
df_dropped=df.drop("JoinDate",axis=1)

## set_index()
* set any column specified as index
## reset_index()
* reset the index

In [119]:
setindex=df.set_index("Name")

In [120]:
setindex.reset_index()

      Name    Age Gender  Score    JoinDate
0    Alice  25.00      F   85.0  2020-01-15
1      Bob  30.00      M   90.0  2019-06-23
2  Charlie  35.00      M   95.0  2021-07-19
3    David  33.75      M   88.0  2022-09-10
4      Eva  45.00      F   89.5  2018-04-12

## duplicated()
* check the duplicate values

## drop_duplicates()
* drop the duplicate values

In [121]:
df.duplicated().sum()    #checking duplicate values

0

In [122]:
df.drop_duplicates()     # dropping duplicates

      Name    Age Gender  Score    JoinDate
0    Alice  25.00      F   85.0  2020-01-15
1      Bob  30.00      M   90.0  2019-06-23
2  Charlie  35.00      M   95.0  2021-07-19
3    David  33.75      M   88.0  2022-09-10
4      Eva  45.00      F   89.5  2018-04-12

## apply()
* we can apply a function to each element in a column

In [123]:
df["AgePlus1"]=df["Age"].apply(lambda x:x+1)

In [124]:
df

      Name    Age Gender  Score    JoinDate  AgePlus1
0    Alice  25.00      F   85.0  2020-01-15     26.00
1      Bob  30.00      M   90.0  2019-06-23     31.00
2  Charlie  35.00      M   95.0  2021-07-19     36.00
3    David  33.75      M   88.0  2022-09-10     34.75
4      Eva  45.00      F   89.5  2018-04-12     46.00

In [125]:
df["Name"]=df["Name"].apply(lambda x:x+'s')

In [126]:
df

       Name    Age Gender  Score    JoinDate  AgePlus1
0    Alices  25.00      F   85.0  2020-01-15     26.00
1      Bobs  30.00      M   90.0  2019-06-23     31.00
2  Charlies  35.00      M   95.0  2021-07-19     36.00
3    Davids  33.75      M   88.0  2022-09-10     34.75
4      Evas  45.00      F   89.5  2018-04-12     46.00

## String Manipulation for categorical columns

In [127]:
df["Name"]=df["Name"].str.replace('s'," ")

In [128]:
df

       Name    Age Gender  Score    JoinDate  AgePlus1
0    Alice   25.00      F   85.0  2020-01-15     26.00
1      Bob   30.00      M   90.0  2019-06-23     31.00
2  Charlie   35.00      M   95.0  2021-07-19     36.00
3    David   33.75      M   88.0  2022-09-10     34.75
4      Eva   45.00      F   89.5  2018-04-12     46.00

In [129]:
df["Name"]=df["Name"].str.upper()

In [130]:
df

       Name    Age Gender  Score    JoinDate  AgePlus1
0    ALICE   25.00      F   85.0  2020-01-15     26.00
1      BOB   30.00      M   90.0  2019-06-23     31.00
2  CHARLIE   35.00      M   95.0  2021-07-19     36.00
3    DAVID   33.75      M   88.0  2022-09-10     34.75
4      EVA   45.00      F   89.5  2018-04-12     46.00

## converting to categorical type and then numerical codes
* astype('category')---converts to category type
* cat.codes --- gives numerical codes as 0 and 1

In [131]:
df["Gender"]=df["Gender"].astype('category')

In [133]:
df["Gender"]=df["Gender"].cat.codes

In [134]:
df

       Name    Age  Gender  Score    JoinDate  AgePlus1
0    ALICE   25.00       0   85.0  2020-01-15     26.00
1      BOB   30.00       1   90.0  2019-06-23     31.00
2  CHARLIE   35.00       1   95.0  2021-07-19     36.00
3    DAVID   33.75       1   88.0  2022-09-10     34.75
4      EVA   45.00       0   89.5  2018-04-12     46.00

# 5. Counting and unique values

In [135]:
df["Gender"].unique()    # give the unique values in that column

array([0, 1], dtype=int8)

In [136]:
df["Gender"].nunique()   #count the num of unique values

2

In [138]:
df["Gender"].value_counts()  # gives the count of each category

Gender
1    3
0    2
Name: count, dtype: int64

In [139]:
df["Gender"].isin([0,1])   #it checks like a membership

0    True
1    True
2    True
3    True
4    True
Name: Gender, dtype: bool

# 6. Grouping and Aggregation

In [140]:
df.groupby('Gender')['Score'].sum()

Gender
0    174.5
1    273.0
Name: Score, dtype: float32

In [49]:
df.groupby("Gender")["Score"].agg("mean")

Gender
F    85.0
M    91.0
Name: Score, dtype: float64

In [141]:
df.agg({'Score':['mean','max'],'Age':'median'})

        Score    Age
mean     89.5    NaN
max      95.0    NaN
median    NaN  33.75

### transform() : 
*       transform will give output of same shape as original input and it will broadcast the group-level results to each row

In [50]:
df.groupby("Gender")["Score"].transform("mean")

0    85.0
1    91.0
2    91.0
3    91.0
4    85.0
Name: Score, dtype: float64

In [143]:
df["Score"].mean()

89.5

# 7. Sorting

In [145]:
df.sort_values(by="Score",ascending=False)

       Name    Age  Gender  Score    JoinDate  AgePlus1
2  CHARLIE   35.00       1   95.0  2021-07-19     36.00
1      BOB   30.00       1   90.0  2019-06-23     31.00
4      EVA   45.00       0   89.5  2018-04-12     46.00
3    DAVID   33.75       1   88.0  2022-09-10     34.75
0    ALICE   25.00       0   85.0  2020-01-15     26.00

In [146]:
df.sort_values("Age",ascending=False)

       Name    Age  Gender  Score    JoinDate  AgePlus1
4      EVA   45.00       0   89.5  2018-04-12     46.00
2  CHARLIE   35.00       1   95.0  2021-07-19     36.00
3    DAVID   33.75       1   88.0  2022-09-10     34.75
1      BOB   30.00       1   90.0  2019-06-23     31.00
0    ALICE   25.00       0   85.0  2020-01-15     26.00

### rank() :

*  it will assigns a rank to the values

In [55]:
df["Age"].rank()

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
Name: Age, dtype: float64

### assign: 
*  it will create new columns without modifying the original df

In [56]:
df.assign(Passed=df["Score"]>80)

      Name   Age Gender  Score    JoinDate  Passed
0    Alice  25.0      F   85.0  2020-01-15    True
1      Bob  30.0      M   90.0  2019-06-23    True
2  Charlie  35.0      M   95.0  2021-07-19    True
3    David   NaN      M   88.0  2022-09-10    True
4      Eva  45.0      F    NaN  2018-04-12   False

### map():
    map the values using a dictionary or function

In [63]:
mapping=df["Gender"].map({"F":"Female","M":"Male"})

In [64]:
mapping

0    Female
1      Male
2      Male
3      Male
4    Female
Name: Gender, dtype: object

# 8. Concatenation and Merging

* pd.concat([df1,df2],axis=0) ---- row wise concatenation
* pd.concat([df1,df2],axis=1) ---- column wise concatenation

In [9]:


# Example DataFrames
df1 = pd.DataFrame({'ID': [1, 2], 'Name': ['Alice', 'Bob']})
df2 = pd.DataFrame({'ID': [3, 4], 'Name': ['Charlie', 'David']})

# Row-wise concatenation
result_rows = pd.concat([df1, df2],axis=0)

In [10]:
result_rows

   ID     Name
0   1    Alice
1   2      Bob
0   3  Charlie
1   4    David

In [6]:
# Column-wise concatenation (must match row index)
df3 = pd.DataFrame({'Age': [25, 30, 35, 40]})
result_cols = pd.concat([result_rows.reset_index(drop=True),df3],axis=1)
result_cols

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
3   4    David   40

##  Merging

* pd.merge(df1,df2,on="common_col",how="inner" "outer" "left" "right")

In [154]:
pd.merge(df1,df2,on="ID",how="outer")

   ID Name_x   Name_y
0   1  Alice      NaN
1   2    Bob      NaN
2   3    NaN  Charlie
3   4    NaN    David

In [155]:
pd.merge(df1,df2,on="ID",how="left")

   ID Name_x Name_y
0   1  Alice    NaN
1   2    Bob    NaN

In [156]:
pd.merge(df1,df2,on="ID",how="right")

   ID Name_x   Name_y
0   3    NaN  Charlie
1   4    NaN    David

# 9. Reshaping the data

* pivot() : gives a wide format of longer input

           Reshapes the DataFrame by pivoting (rotating) unique values of one column into new columns.
* melt()  : gives a long format from wide input

            Unpivots (flattens) a DataFrame from wide format to long format. It's the reverse of pivot.

* stack() : Converts columns into row-level index values (longer format). Used for hierarchical data.
* unstack() : The reverse of stack(). Moves row-level index values into columns (wider format).
* pivot_table() : creates a pivot table with aggregation on values. simlilar to pivot() 
* transpose() : to flip or swap the rows and cols (.T)

In [16]:
df_pivot=df.pivot(index="Gender",columns="Name",values="Score")
df_pivot

Name    Alice   Bob  Charlie  David  Eva
Gender
F        85.0   NaN      NaN    NaN  NaN
M         NaN  90.0     95.0   88.0  NaN

In [20]:
df_melt=df_pivot.reset_index().melt(id_vars="Gender",var_name="Name",value_name="Score")

In [21]:
df_melt

  Gender     Name  Score
0      F    Alice   85.0
1      M    Alice    NaN
2      F      Bob    NaN
3      M      Bob   90.0
4      F  Charlie    NaN
5      M  Charlie   95.0
6      F    David    NaN
7      M    David   88.0
8      F      Eva    NaN
9      M      Eva    NaN

In [28]:
df_stack=df.stack(level=-1,dropna=False)
df_stack

0  Name             Alice
   Age               25.0
   Gender               F
   Score             85.0
   JoinDate    2020-01-15
1  Name               Bob
   Age               30.0
   Gender               M
   Score             90.0
   JoinDate    2019-06-23
2  Name           Charlie
   Age               35.0
   Gender               M
   Score             95.0
   JoinDate    2021-07-19
3  Name             David
   Age                NaN
   Gender               M
   Score             88.0
   JoinDate    2022-09-10
4  Name               Eva
   Age               45.0
   Gender               F
   Score              NaN
   JoinDate    2018-04-12
dtype: object

In [26]:
df_unstack=df_stack.unstack()
df_unstack

      Name   Age Gender Score    JoinDate
0    Alice  25.0      F  85.0  2020-01-15
1      Bob  30.0      M  90.0  2019-06-23
2  Charlie  35.0      M  95.0  2021-07-19
3    David   NaN      M  88.0  2022-09-10
4      Eva  45.0      F   NaN  2018-04-12

In [31]:
df.pivot_table(index="Gender",values="Score",columns="Name",aggfunc="max")

Name    Alice   Bob  Charlie  David
Gender
F        85.0   NaN      NaN    NaN
M         NaN  90.0     95.0   88.0

In [33]:
df_trans=df.T
df_trans

                   0           1           2           3           4
Name           Alice         Bob     Charlie       David         Eva
Age             25.0        30.0        35.0         NaN        45.0
Gender             F           M           M           M           F
Score           85.0        90.0        95.0        88.0         NaN
JoinDate  2020-01-15  2019-06-23  2021-07-19  2022-09-10  2018-04-12

# 10. Date and Time methods

* to_datetime() : will converts the Date column to datetime format
* .dt (accessor) : it will extracts the year,month,day,day_name,month_name,weekday,time,hour,minute...etc
* date_range() : it will create a range of dates from start and end specified by user
* Timedelta() : performs date arithmatic like sum,sub...
* .dt.strftime() : it will format the date as string

In [34]:
df["JoinDate"]=pd.to_datetime(df["JoinDate"])

In [35]:
df

      Name   Age Gender  Score   JoinDate
0    Alice  25.0      F   85.0 2020-01-15
1      Bob  30.0      M   90.0 2019-06-23
2  Charlie  35.0      M   95.0 2021-07-19
3    David   NaN      M   88.0 2022-09-10
4      Eva  45.0      F    NaN 2018-04-12

In [38]:
print(df["JoinDate"].dt.year)
print(df["JoinDate"].dt.month)
print(df["JoinDate"].dt.day)
print(df["JoinDate"].dt.day_name())
print(df["JoinDate"].dt.month_name())
print(df["JoinDate"].dt.weekday)
print(df["JoinDate"].dt.time)
print(df["JoinDate"].dt.hour)
print(df["JoinDate"].dt.minute)
print(df["JoinDate"].dt.strftime('%Y-%M-%D'))

0    2020
1    2019
2    2021
3    2022
4    2018
Name: JoinDate, dtype: int32
0    1
1    6
2    7
3    9
4    4
Name: JoinDate, dtype: int32
0    15
1    23
2    19
3    10
4    12
Name: JoinDate, dtype: int32
0    Wednesday
1       Sunday
2       Monday
3     Saturday
4     Thursday
Name: JoinDate, dtype: object
0      January
1         June
2         July
3    September
4        April
Name: JoinDate, dtype: object
0    2
1    6
2    0
3    5
4    3
Name: JoinDate, dtype: int32
0    00:00:00
1    00:00:00
2    00:00:00
3    00:00:00
4    00:00:00
Name: JoinDate, dtype: object
0    0
1    0
2    0
3    0
4    0
Name: JoinDate, dtype: int32
0    0
1    0
2    0
3    0
4    0
Name: JoinDate, dtype: int32
0    2020-00-01/15/20
1    2019-00-06/23/19
2    2021-00-07/19/21
3    2022-00-09/10/22
4    2018-00-04/12/18
Name: JoinDate, dtype: object

In [43]:
date_range=pd.date_range(start='2025-04-16',end='2025-05-16',freq="D")
date_range

DatetimeIndex(['2025-04-16', '2025-04-17', '2025-04-18', '2025-04-19',
               '2025-04-20', '2025-04-21', '2025-04-22', '2025-04-23',
               '2025-04-24', '2025-04-25', '2025-04-26', '2025-04-27',
               '2025-04-28', '2025-04-29', '2025-04-30', '2025-05-01',
               '2025-05-02', '2025-05-03', '2025-05-04', '2025-05-05',
               '2025-05-06', '2025-05-07', '2025-05-08', '2025-05-09',
               '2025-05-10', '2025-05-11', '2025-05-12', '2025-05-13',
               '2025-05-14', '2025-05-15', '2025-05-16'],
              dtype='datetime64[ns]', freq='D')

In [45]:
df["Next_Week"]=df["JoinDate"]+pd.Timedelta(days=7)
df["Next_Week"]

0   2020-01-22
1   2019-06-30
2   2021-07-26
3   2022-09-17
4   2018-04-19
Name: Next_Week, dtype: datetime64[ns]

In [48]:
df["previous_day"]=df["JoinDate"]-pd.Timedelta(days=1)
df["previous_day"]

0   2020-01-14
1   2019-06-22
2   2021-07-18
3   2022-09-09
4   2018-04-11
Name: previous_day, dtype: datetime64[ns]